Tekla.Structures.ModelInternal.RebarLegFace.Operation
The Operation.

Tekla.Structures.ModelInternal.RebarLegFace.Operation.ADD
The Add operation.

Tekla.Structures.ModelInternal.RebarLegFace.Operation.CUT
The Cut operation.